tests/fixtures/xml/revoke_sale.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/">
  <SOAP-ENV:Header/>
  <SOAP-ENV:Body>
    <ipgapi:IPGApiOrderRequest xmlns:v1="http://ipg-online.com/ipgapi/schemas/v1" xmlns:ipgapi="http://ipg-online.com/ipgapi/schemas/ipgapi">
      <v1:Transaction>
        <v1:CreditCardTxType>
          <v1:Type>void</v1:Type>
        </v1:CreditCardTxType>
        <v1:TransactionDetails>
          <v1:OrderId>1</v1:OrderId>
          <v1:TDate>1190244932</v1:TDate>
        </v1:TransactionDetails>
      </v1:Transaction>
    </ipgapi:IPGApiOrderRequest>
  </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
