_includes/authipay/code/datavault-multiple-actions-xml.html

&lt;?xml version="1.0" encoding="UTF-8"?&gt;
&lt;env:Envelope xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:v1="http://ipg-online.com/ipgapi/schemas/ipgapi" xmlns:env="http://schemas.xmlsoap.org/soap/envelope/"&gt;
  &lt;env:Body&gt;
    &lt;ns4:IPGApiActionRequest xmlns:ns4="http://ipg-online.com/ipgapi/schemas/ipgapi" xmlns:ns2="http://ipg-online.com/ipgapi/schemas/a1" xmlns:ns3="http://ipg-online.com/ipgapi/schemas/v1"&gt;
      &lt;ns2:Action&gt;
        &lt;ns2:StoreHostedData&gt;
          &lt;ns2:DataStorageItem&gt;
            &lt;ns2:CreditCardData&gt;
              &lt;ns3:CardNumber&gt;42424242424242424242&lt;/ns3:CardNumber&gt;
              &lt;ns3:ExpMonth&gt;12&lt;/ns3:ExpMonth&gt;
              &lt;ns3:ExpYear&gt;08&lt;/ns3:ExpYear&gt;
            &lt;/ns2:CreditCardData&gt;
            &lt;ns2:HostedDataID&gt;d763bba7-1cfa-4d3d-94af-9fbe29ec0e26&lt;/ns2:HostedDataID&gt;
          &lt;/ns2:DataStorageItem&gt;
          &lt;ns2:DataStorageItem&gt;
            &lt;ns2:Function&gt;display&lt;/ns2:Function&gt;
            &lt;ns2:HostedDataID&gt;d763bba7-1cfa-4d3d-94af-9fbe29ec0e26&lt;/ns2:HostedDataID&gt;
          &lt;/ns2:DataStorageItem&gt;
          &lt;ns2:DataStorageItem&gt;
            &lt;ns2:Function&gt;delete&lt;/ns2:Function&gt;
            &lt;ns2:HostedDataID&gt;d763bba7-1cfa-4d3d-94af-9fbe29ec0e26&lt;/ns2:HostedDataID&gt;
          &lt;/ns2:DataStorageItem&gt;
        &lt;/ns2:StoreHostedData&gt;
      &lt;/ns2:Action&gt;
    &lt;/ns4:IPGApiActionRequest&gt;
  &lt;/env:Body&gt;
&lt;/env:Envelope&gt;
